---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction
source: html/3468e6dd-c676-cf39-b851-052b3e3a2f95.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction

Construction definition for Project Information.

## Syntax (C#)
```csharp
public class MEPBuildingConstruction : ElementType
```

## Remarks
This is used to define the information in Constructions.xml.